Documents/ПоследствияНесчастногоСлучая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПоследствияНесчастногоСлучая</Name>
			<BasedOn>
				<xr:Item>Document.НесчастныйСлучайНаПроизводстве</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НесчастныйСлучайНаПроизводстве</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьИспорченногоОборудования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРазрушенныхЗданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешениеПрокуратуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммарныйМатериальныйУщерб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроисшествия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставПострадавшие</Name>
					<Comment>АПК:58 Краткий перечень пострадавших сотрудников</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пострадавшие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пострадавший</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Последствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоследствияНесчастныхСлучаев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончательныйДиагноз</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерЕжемесячнойВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриказОНазначенииЕжемесячныхВыплат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БольничныеЛистыПострадавших</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пострадавший</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БольничныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/РабочиеМестаОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РабочиеМестаОхраныТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеРабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетУсловиямТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВредныеФакторыСопоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПоследствияНесчастногоСлучая/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Пострадавшие.Пострадавший, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, ,
		"НесчастныеСлучаи");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	ОписаниеСостава.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	ОписаниеСостава.ИспользоватьКраткийСостав = Ложь;
	ОписаниеСостава.ИспользоватьОграничениеДоступа = Ложь;
	ОписаниеСостава.ЗаполнятьТабличнуюЧастьФизическиеЛицаДокумента = Ложь;
	
	ЗарплатаКадрыСоставДокументов.ДобавитьОписаниеХраненияСотрудниковФизическихЛиц(
		ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц,
		"Пострадавшие",
		"Пострадавший");
		
	Возврат ОписаниеСостава;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ДатаПриказа223Н = ОхранаТруда.ДатаВступленияВСилуПриказа223Н();
	
	// Сообщение о последствиях несчастного случая
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ПоследствияНесчастногоСлучая";
	КомандаПечати.Идентификатор = "ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2003Кв1";
	КомандаПечати.Представление = НСтр("ru = 'Сообщение о последствиях несчастного случая'");
	КомандаПечати.Порядок = 15;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.Меньше);
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадры";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ПоследствияНесчастногоСлучая";
	КомандаПечати.Идентификатор = "ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2022Кв3";
	КомандаПечати.Представление = НСтр("ru = 'Сообщение о последствиях несчастного случая'");
	КомандаПечати.Порядок = 15;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадры";
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2003Кв1") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.ПоследствияНесчастногоСлучая.ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2003Кв1");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2003Кв1",
			НСтр("ru = 'Сообщение о последствиях несчастного случая'"), ПечатьСообщенияОПоследствияхНесчастногоСлучая(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.ПоследствияНесчастногоСлучая.ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2003Кв1");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2022Кв3") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.ПоследствияНесчастногоСлучая.ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2022Кв3");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2022Кв3",
			НСтр("ru = 'Сообщение о последствиях несчастного случая'"), ПечатьСообщенияОПоследствияхНесчастногоСлучая(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.ПоследствияНесчастногоСлучая.ПФ_MXL_СообщениеОПоследствияхНесчастногоСлучая2022Кв3");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСообщенияОПоследствияхНесчастногоСлучая(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоследствияНесчастногоСлучая_СообщениеОПоследствияхНесчастногоСлучая";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ПервыйПострадавший = Истина;
		Для каждого СтрокаПострадавшего Из ДанныеДокумента.МассивПострадавших Цикл
			
			// Документы нужно выводить на разных страницах.
			Если Не ПервыйПострадавший Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйПострадавший = Ложь;
			КонецЕсли;
			
			Область1_1 = Макет.ПолучитьОбласть("Область1_1");
			Область1_2 = Макет.ПолучитьОбласть("Область1_2");
			Область2 = Макет.ПолучитьОбласть("Область2");
			Область3 = Макет.ПолучитьОбласть("Область3");
			Область4 = Макет.ПолучитьОбласть("Область4");
			Область5 = Макет.ПолучитьОбласть("Область5");
			ДопСтрока = Макет.ПолучитьОбласть("ДопСтрока");
			
			////////////////////////////////////////////////
			// Область 1_1
			
			Область1_1.Параметры.ДатаПроисшествия = ДанныеДокумента.ДатаПроисшествия;
			Область1_1.Параметры.ДатаНомерАкта = ДанныеДокумента.НомерАкта + ?(ПустаяСтрока(ДанныеДокумента.ДатаАкта), "", " от ") + ДанныеДокумента.ДатаАкта;
			Область1_1.Параметры.ФИОПострадавшего = СтрокаПострадавшего.ФИОПолные;
			Область1_1.Параметры.Должность = СтрокаПострадавшего.НаименованиеДолжности;
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОбОрганизации, "110,110,999");
			Область1_1.Параметры.СведенияОбОрганизацииЧасть1 =  СписокСтрок[0];
			Область1_1.Параметры.СведенияОбОрганизацииЧасть2 =  СписокСтрок[1];
			Область1_1.Параметры.СведенияОбОрганизацииЧасть3 =  СписокСтрок[2];
			
			Утверждающий = Строка(ДанныеДокумента.ДолжностьРуководителя) + " " + Строка(ДанныеДокумента.ФИОРуководителя);
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(Утверждающий, "55, 999");
			Область1_1.Параметры.УтверждающийЧасть1 = СписокСтрок[0];
			Область1_1.Параметры.УтверждающийЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область1_1);
			Если ЗначениеЗаполнено(СтрокаПострадавшего.Последствия.ИмяПредопределенныхДанных) Тогда
				ОбластьПоследствия = Макет.ПолучитьОбласть(СтрокаПострадавшего.Последствия.ИмяПредопределенныхДанных);
				ТабличныйДокумент.Вывести(ОбластьПоследствия);
			КонецЕсли;
			
			////////////////////////////////////////////////
			// Область 1_2
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.ОкончательныйДиагноз, "110");
			Область1_2.Параметры.ОкончательныйДиагнозЧасть1 = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область1_2);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 2
			
			Область2.Параметры.Заполнить(ДанныеДокумента);
			Область2.Параметры.Заполнить(СтрокаПострадавшего);
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.ПриказОНазначенииЕжемесячныхВыплат, "65, 110");
			Область2.Параметры.ПриказОНазначенииЕжемесячныхВыплатЧасть1 = СписокСтрок[0];
			Область2.Параметры.ПриказОНазначенииЕжемесячныхВыплатЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область2);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 3
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.РешениеПрокуратуры, "65, 110");
			Область3.Параметры.РешениеПрокуратурыЧасть1 = СписокСтрок[0];
			Область3.Параметры.РешениеПрокуратурыЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область3);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 4
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.МероприятияПоУстранениюПричин, "110, 110, 110");
			Область4.Параметры.МероприятияПоУстранениюПричинЧасть1 = СписокСтрок[0];
			Область4.Параметры.МероприятияПоУстранениюПричинЧасть2 = СписокСтрок[1];
			Область4.Параметры.МероприятияПоУстранениюПричинЧасть3 = СписокСтрок[2];
			
			ТабличныйДокумент.Вывести(Область4);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 3);
			
			/////////////////////////////////////////////////
			// Область 5
			
			Область5.Параметры.ФИОДиректор = ДанныеДокумента.ФИОРуководителя;
			Область5.Параметры.ФИОГлавныйБухгалтер = ДанныеДокумента.ФИОГлавногоБухгалтера;
			
			ТабличныйДокумент.Вывести(Область5);
			
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц  = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоследствияНесчастногоСлучая.Ссылка КАК Ссылка,
	|	ПоследствияНесчастногоСлучая.Номер КАК Номер,
	|	ПоследствияНесчастногоСлучая.Дата КАК Дата,
	|	ПоследствияНесчастногоСлучая.Проведен КАК Проведен,
	|	ПоследствияНесчастногоСлучая.Организация КАК Организация,
	|	Организации.НаименованиеПолное КАК НаименованиеОрганизации,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	ПоследствияНесчастногоСлучая.Подразделение КАК Подразделение,
	|	ПоследствияНесчастногоСлучая.ДокументОснование КАК ДокументОснование,
	|	ПоследствияНесчастногоСлучая.СтоимостьИспорченногоОборудования КАК СтоимостьИспорченногоОборудования,
	|	ПоследствияНесчастногоСлучая.СтоимостьРазрушенныхЗданий КАК СтоимостьРазрушенныхЗданий,
	|	ПоследствияНесчастногоСлучая.ПрочиеРасходы КАК ПрочиеРасходы,
	|	ПоследствияНесчастногоСлучая.СуммарныйМатериальныйУщерб КАК СуммарныйМатериальныйУщерб,
	|	ПоследствияНесчастногоСлучая.РешениеПрокуратуры КАК РешениеПрокуратуры,
	|	ПоследствияНесчастногоСлучая.ДатаПроисшествия КАК ДатаПроисшествия,
	|	ПоследствияНесчастногоСлучая.ДатаАкта КАК ДатаАкта,
	|	ПоследствияНесчастногоСлучая.НомерАкта КАК НомерАкта,
	|	ПоследствияНесчастногоСлучая.Руководитель КАК Руководитель,
	|	ПоследствияНесчастногоСлучая.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПоследствияНесчастногоСлучая.ОтветственныйЗаОхрануТруда КАК ОтветственныйЗаОхрануТруда,
	|	ПоследствияНесчастногоСлучая.ДолжностьОтветственногоЗаОхрануТруда КАК ДолжностьОтветственногоЗаОхрануТруда,
	|	ПоследствияНесчастногоСлучая.КраткийСоставПострадавшие КАК КраткийСоставПострадавшие,
	|	ПоследствияНесчастногоСлучая.Ответственный КАК Ответственный,
	|	ПоследствияНесчастногоСлучая.Комментарий КАК Комментарий,
	|	НесчастныйСлучайНаПроизводстве.ДатаПроисшествия КАК ДатаПроисшествияДатаВремя,
	|	НесчастныйСлучайНаПроизводстве.МероприятияПоУстранениюПричин КАК МероприятияПоУстранениюПричин
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.ПоследствияНесчастногоСлучая КАК ПоследствияНесчастногоСлучая
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
	|		ПО ПоследствияНесчастногоСлучая.ДокументОснование = НесчастныйСлучайНаПроизводстве.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПоследствияНесчастногоСлучая.Организация = Организации.Ссылка
	|ГДЕ
	|	ПоследствияНесчастногоСлучая.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследствияНесчастногоСлучаяБольничныеЛистыПострадавших.Ссылка КАК Ссылка,
	|	ПоследствияНесчастногоСлучаяБольничныеЛистыПострадавших.Пострадавший КАК Пострадавший,
	|	МИНИМУМ(БольничныеЛисты.ДатаНачала) КАК НачалоБольничного,
	|	МАКСИМУМ(БольничныеЛисты.ДатаОкончания) КАК ОкончаниеБольничного
	|ПОМЕСТИТЬ ВТБольничныеЛистыДаты
	|ИЗ
	|	Документ.ПоследствияНесчастногоСлучая.БольничныеЛистыПострадавших КАК ПоследствияНесчастногоСлучаяБольничныеЛистыПострадавших
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО ПоследствияНесчастногоСлучаяБольничныеЛистыПострадавших.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.БольничныйЛист КАК БольничныеЛисты
	|		ПО ПоследствияНесчастногоСлучаяБольничныеЛистыПострадавших.БольничныйЛист = БольничныеЛисты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследствияНесчастногоСлучаяБольничныеЛистыПострадавших.Ссылка,
	|	ПоследствияНесчастногоСлучаяБольничныеЛистыПострадавших.Пострадавший
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка.Организация КАК Организация,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший КАК Пострадавший,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто КАК РабочееМесто,
	|	Должности.Наименование КАК НаименованиеДолжности,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СтажОбщийПредставление КАК СтажОбщийПредставление,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СтажВОрганизацииПредставление КАК СтажВОрганизацииПредставление,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ОпьянениеПострадавшего КАК ОпьянениеПострадавшего,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ВидИСтепеньОпьянения КАК ВидИСтепеньОпьянения,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ХарактерПовреждений КАК ХарактерПовреждений,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СведенияСОУТ КАК СведенияСОУТ,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СведенияОПСОУТ КАК СведенияОПСОУТ,
	|	ПоследствияНесчастногоСлучаяПострадавшие.Последствия КАК Последствия,
	|	ПоследствияНесчастногоСлучаяПострадавшие.ОкончательныйДиагноз КАК ОкончательныйДиагноз,
	|	ПоследствияНесчастногоСлучаяПострадавшие.РазмерЕжемесячнойВыплаты КАК РазмерЕжемесячнойВыплаты,
	|	ПоследствияНесчастногоСлучаяПострадавшие.ПриказОНазначенииЕжемесячныхВыплат КАК ПриказОНазначенииЕжемесячныхВыплат,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период,
	|	ЕСТЬNULL(БольничныеЛисты.НачалоБольничного, """") КАК НачалоБольничного,
	|	ЕСТЬNULL(БольничныеЛисты.ОкончаниеБольничного, """") КАК ОкончаниеБольничного,
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(БольничныеЛисты.НачалоБольничного, БольничныеЛисты.ОкончаниеБольничного, ДЕНЬ) + 1, 0) КАК КоличествоБольничныхДней
	|ПОМЕСТИТЬ ВТПострадавшиеФизическиеЛица
	|ИЗ
	|	Документ.ПоследствияНесчастногоСлучая.Пострадавшие КАК ПоследствияНесчастногоСлучаяПострадавшие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО ПоследствияНесчастногоСлучаяПострадавшие.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
	|		ПО (ДанныеДокументов.ДокументОснование = НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка)
	|			И ПоследствияНесчастногоСлучаяПострадавшие.Пострадавший = НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБольничныеЛистыДаты КАК БольничныеЛисты
	|		ПО (ДанныеДокументов.Ссылка = БольничныеЛисты.Ссылка)
	|			И ПоследствияНесчастногоСлучаяПострадавшие.Пострадавший = БольничныеЛисты.Пострадавший
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
	|		ПО (НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто = РабочиеМеста.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО (РабочиеМеста.Должность = Должности.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТСведенияОбОтветственныхЛицахОтбор
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов";
	
	Запрос.Выполнить();
	
	СведенияОбОтветственныхЛицах.СоздатьВТСведенияОбОтветственныхЛицах(Запрос.МенеджерВременныхТаблиц, "ВТСведенияОбОтветственныхЛицахОтбор", "ГлавныйБухгалтер", "ВТОтветственныеЛица");
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТПострадавшиеФизическиеЛица", "Пострадавший,Период");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФамилияИО, ФИОПолные, Профессии");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пострадавшие.Ссылка КАК Ссылка,
	|	Пострадавшие.Организация КАК Организация,
	|	Пострадавшие.Пострадавший КАК Пострадавший,
	|	Пострадавшие.РабочееМесто КАК РабочееМесто,
	|	Пострадавшие.НаименованиеДолжности КАК НаименованиеДолжности,
	|	Пострадавшие.СтажОбщийПредставление КАК СтажОбщийПредставление,
	|	Пострадавшие.СтажВОрганизацииПредставление КАК СтажВОрганизацииПредставление,
	|	Пострадавшие.ОпьянениеПострадавшего КАК ОпьянениеПострадавшего,
	|	Пострадавшие.ВидИСтепеньОпьянения КАК ВидИСтепеньОпьянения,
	|	Пострадавшие.ХарактерПовреждений КАК ХарактерПовреждений,
	|	Пострадавшие.СведенияСОУТ КАК СведенияСОУТ,
	|	Пострадавшие.СведенияОПСОУТ КАК СведенияОПСОУТ,
	|	Пострадавшие.Последствия КАК Последствия,
	|	Пострадавшие.ОкончательныйДиагноз КАК ОкончательныйДиагноз,
	|	Пострадавшие.РазмерЕжемесячнойВыплаты КАК РазмерЕжемесячнойВыплаты,
	|	Пострадавшие.ПриказОНазначенииЕжемесячныхВыплат КАК ПриказОНазначенииЕжемесячныхВыплат,
	|	Пострадавшие.НачалоБольничного КАК НачалоБольничного,
	|	Пострадавшие.ОкончаниеБольничного КАК ОкончаниеБольничного,
	|	Пострадавшие.КоличествоБольничныхДней КАК КоличествоБольничныхДней,
	|	КадровыеДанныеФизическихЛиц.ФамилияИО КАК ФамилияИО,
	|	КадровыеДанныеФизическихЛиц.ФИОПолные КАК ФИОПолные,
	|	КадровыеДанныеФизическихЛиц.Профессии КАК Профессии
	|ПОМЕСТИТЬ ВТПострадавшие
	|ИЗ
	|	ВТПострадавшиеФизическиеЛица КАК Пострадавшие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО Пострадавшие.Пострадавший = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОбОтветственныхЛицахОтбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПострадавшиеФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеФизическихЛиц";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеДокументов.Номер,
	|	ДанныеДокументов.Дата,
	|	ДанныеДокументов.Проведен,
	|	ДанныеДокументов.Организация,
	|	ДанныеДокументов.НаименованиеОрганизации,
	|	ДанныеДокументов.НаименованиеСокращенное,
	|	ДанныеДокументов.Подразделение,
	|	ДанныеДокументов.ДокументОснование,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.СтоимостьИспорченногоОборудования = 0
	|			ТОГДА """"
	|		ИНАЧЕ ДанныеДокументов.СтоимостьИспорченногоОборудования
	|	КОНЕЦ КАК СтоимостьИспорченногоОборудования,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.СтоимостьРазрушенныхЗданий = 0
	|			ТОГДА """"
	|		ИНАЧЕ ДанныеДокументов.СтоимостьРазрушенныхЗданий
	|	КОНЕЦ КАК СтоимостьРазрушенныхЗданий,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.ПрочиеРасходы = 0
	|			ТОГДА """"
	|		ИНАЧЕ ДанныеДокументов.ПрочиеРасходы
	|	КОНЕЦ КАК ПрочиеРасходы,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.СуммарныйМатериальныйУщерб = 0
	|			ТОГДА """"
	|		ИНАЧЕ ДанныеДокументов.СуммарныйМатериальныйУщерб
	|	КОНЕЦ КАК СуммарныйМатериальныйУщерб,
	|	ДанныеДокументов.РешениеПрокуратуры,
	|	ДанныеДокументов.ДатаПроисшествия,
	|	ДанныеДокументов.ДатаАкта,
	|	ДанныеДокументов.НомерАкта,
	|	ДанныеДокументов.Руководитель,
	|	ДанныеДокументов.ДолжностьРуководителя,
	|	ДанныеДокументов.ОтветственныйЗаОхрануТруда,
	|	ДанныеДокументов.ДолжностьОтветственногоЗаОхрануТруда,
	|	ДанныеДокументов.КраткийСоставПострадавшие,
	|	ДанныеДокументов.Ответственный,
	|	ДанныеДокументов.Комментарий,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя,
	|	ДанныеДокументов.МероприятияПоУстранениюПричин,
	|	ОтветственныеЛица.ГлавныйБухгалтер
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветственныеЛица КАК ОтветственныеЛица
	|		ПО ДанныеДокументов.Организация = ОтветственныеЛица.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокументов.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ДанныеПечати = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		ДанныеПечати.Вставить("ДатаПроисшествия", Формат(Выборка.ДатаПроисшествияДатаВремя, "ДЛФ=ДД"));
		ДанныеПечати.Вставить("ДатаАкта", Формат(Выборка.ДатаАкта, "ДЛФ=ДД"));
		
		ДанныеПечати.Вставить("ФИОРуководителя", "");
		ДанныеПечати.Вставить("ФИОГлавногоБухгалтера", "");
		ДанныеПечати.Вставить("МассивПострадавших", Новый Массив);
		ДанныеПечати.Вставить("СведенияОбОрганизации", "");
		
		Если ЗначениеЗаполнено(Выборка.Организация) Тогда
			// Сведения об организации
			КодыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				Выборка.Организация, "КодОКВЭД,НаименованиеОКВЭД,КодОКВЭД2,НаименованиеОКВЭД2,ИНН,НаименованиеОКФС,РегистрационныйНомерФСС");
			
			Если Выборка.Дата < '20170101' И Не ПустаяСтрока(КодыОрганизации.КодОКВЭД) Тогда
				КодОКВЭД = КодыОрганизации.КодОКВЭД;
				НаименованиеОКВЭД = КодыОрганизации.НаименованиеОКВЭД;
			Иначе
				КодОКВЭД = КодыОрганизации.КодОКВЭД2;
				НаименованиеОКВЭД = КодыОрганизации.НаименованиеОКВЭД2;
			КонецЕсли;
			
			ДанныеОбОрганизации = ЗарплатаКадры.СведенияОбОрганизации(Выборка.Организация, "ТелОрганизации");
			
			ПредставлениеФактическогоАдреса = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, , Выборка.Дата);
			ПредставлениеЮридическогоАдреса = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, , Выборка.Дата);
			
			СведенияОбОрганизации = Выборка.НаименованиеОрганизации
				+ ?(ЗначениеЗаполнено(КодОКВЭД), " " + НСтр("ru = 'ОКВЭД'") + ": " + КодОКВЭД, "")+ " " + НаименованиеОКВЭД
				+ ?(ЗначениеЗаполнено(ПредставлениеЮридическогоАдреса), ", " + НСтр("ru = 'юр. адрес'") + ": " + ПредставлениеЮридическогоАдреса, "")
				+ ?(ЗначениеЗаполнено(ПредставлениеФактическогоАдреса), ", " + НСтр("ru = 'факт. адрес'") + ": " + ПредставлениеФактическогоАдреса, "")
				+ ?(ЗначениеЗаполнено(ДанныеОбОрганизации.ТелОрганизации), ", " + НСтр("ru = 'тел'") + ": " + ДанныеОбОрганизации.ТелОрганизации, "");
			ДанныеПечати.Вставить("СведенияОбОрганизации", СведенияОбОрганизации);
			
		КонецЕсли;
		
		// ФИОРуководителя
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.Руководитель, "ФамилияИО", ДанныеПечати.ДатаПроисшествияДатаВремя);
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ФИОРуководителя", СтрокаКадровыхДанных.ФамилияИО);
		КонецЦикла;
		
		// ФИОГлавногоБухгалтера
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.ГлавныйБухгалтер, "ФамилияИО", ДанныеПечати.ДатаПроисшествияДатаВремя);
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ФИОГлавногоБухгалтера", СтрокаКадровыхДанных.ФамилияИО);
		КонецЦикла;
		
		Если ДанныеПечати.СтоимостьИспорченногоОборудования <> "" Тогда
			ДанныеПечати.Вставить("СтоимостьИспорченногоОборудования", Строка(ДанныеПечати.СтоимостьИспорченногоОборудования) + " ("
				+ ЧислоПрописью(ДанныеПечати.СтоимостьИспорченногоОборудования, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2") + ")");
		КонецЕсли;
		
		Если ДанныеПечати.СтоимостьРазрушенныхЗданий <> "" Тогда
			ДанныеПечати.Вставить("СтоимостьРазрушенныхЗданий", Строка(ДанныеПечати.СтоимостьРазрушенныхЗданий) + " ("
				+ ЧислоПрописью(ДанныеПечати.СтоимостьРазрушенныхЗданий, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2") + ")");
		КонецЕсли;
		
		Если ДанныеПечати.ПрочиеРасходы <> "" Тогда
			ДанныеПечати.Вставить("ПрочиеРасходы", Строка(ДанныеПечати.ПрочиеРасходы) + " ("
				+ ЧислоПрописью(ДанныеПечати.ПрочиеРасходы, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2") + ")");
		КонецЕсли;
		
		Если ДанныеПечати.СуммарныйМатериальныйУщерб <> "" Тогда
			ДанныеПечати.Вставить("СуммарныйМатериальныйУщерб", Строка(ДанныеПечати.СуммарныйМатериальныйУщерб) + " ("
				+ ЧислоПрописью(ДанныеПечати.СуммарныйМатериальныйУщерб, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2") + ")");
		КонецЕсли;
		
		// Заполнение соответствия
		ДанныеПечатиОбъектов.Вставить(Выборка.Ссылка, ДанныеПечати);
		
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пострадавшие.Ссылка,
	|	Пострадавшие.Организация,
	|	Пострадавшие.Пострадавший,
	|	Пострадавшие.РабочееМесто,
	|	Пострадавшие.НаименованиеДолжности,
	|	Пострадавшие.СтажОбщийПредставление,
	|	Пострадавшие.СтажВОрганизацииПредставление,
	|	Пострадавшие.ОпьянениеПострадавшего,
	|	Пострадавшие.ВидИСтепеньОпьянения,
	|	Пострадавшие.ХарактерПовреждений,
	|	Пострадавшие.СведенияСОУТ,
	|	Пострадавшие.СведенияОПСОУТ,
	|	Пострадавшие.Последствия,
	|	Пострадавшие.ОкончательныйДиагноз,
	|	Пострадавшие.РазмерЕжемесячнойВыплаты,
	|	Пострадавшие.ПриказОНазначенииЕжемесячныхВыплат,
	|	Пострадавшие.НачалоБольничного,
	|	Пострадавшие.ОкончаниеБольничного,
	|	Пострадавшие.КоличествоБольничныхДней,
	|	Пострадавшие.ФамилияИО,
	|	Пострадавшие.ФИОПолные,
	|	Пострадавшие.Профессии
	|ИЗ
	|	ВТПострадавшие КАК Пострадавшие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пострадавшие.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПострадавших = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СтрокаПострадавшего = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			СтрокаПострадавшего.НачалоБольничного = Формат(Выборка.НачалоБольничного, "ДЛФ=ДД");
			СтрокаПострадавшего.ОкончаниеБольничного = Формат(Выборка.ОкончаниеБольничного, "ДЛФ=ДД");
			Если СтрокаПострадавшего.РазмерЕжемесячнойВыплаты <> 0 Тогда
				СтрокаПострадавшего.РазмерЕжемесячнойВыплаты = Строка(СтрокаПострадавшего.РазмерЕжемесячнойВыплаты) + " ("
					+ ЧислоПрописью(СтрокаПострадавшего.РазмерЕжемесячнойВыплаты, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2") + ")";
			Иначе
				СтрокаПострадавшего.РазмерЕжемесячнойВыплаты = "";
			КонецЕсли;
			
			МассивПострадавших.Добавить(СтрокаПострадавшего);
		КонецЦикла;
		ДанныеПечати.Вставить("МассивПострадавших", МассивПострадавших);
		
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
